//TODO Вам дадуть слово. Ваше завдання - повернути середній символ слова. Якщо довжина слова непарна, поверніть середній символ. Якщо довжина слова парна, поверніть 2 середніх символи. #Приклади:

//* Kata.getMiddle("test") should return "es"

//* Kata.getMiddle("testing") should return "t"

//* Kata.getMiddle("middle") should return "dd"

//* Kata.getMiddle("A") should return "A"

// todo Введення. Слово (рядок) довжини 0 < str < 1000(у javascript ви можете отримати трохи більше 1000 у деяких тестових випадках через помилку в тестових випадках). Тестувати для цього не потрібно. Це лише для того, щоб сказати вам, що вам не потрібно турбуватися про те, що час очікування вашого рішення закінчиться. Вихід: Середній символ(и) слова, представленого у вигляді рядка.

// function getMiddle(s) {
//    let str = s.split('');
//    let midelem = Math.floor(str.length / 2),
//       midelem2 = str.length / 2 - 1,
//       midelem3 = str.length / 2;

//    if (str.length % 2 > 0) {
//       return str[midelem];
//    } else {
//       return str[midelem2] + str[midelem3];
//    }
// }

// console.log(getMiddle('wordsisbeautiful   '));

// TODO Це досить просто. Ваша мета — створити функцію, яка видаляє перший і останній символи рядка. Вам надається один параметр, вихідний рядок. Вам не потрібно турбуватися про рядки з менш ніж двома символами.

// Var 1

// function removeChar(str) {
//    let string = str.split(''); // Розбиваємо рядок на масив символів
//    string.pop(); // Видаляємо останній символ
//    string.shift(); // Видаляємо перший символ
//    return string.join(''); // Об'єднуємо масив назад у рядок і повертаємо результат
// }

// console.log(removeChar('world'));

// Var 2

// function removeChar(str) {
//    return str.slice(1, -1);
// }

// console.log(removeChar('world'));

// TODO Напишіть функцію, яка приймає ціле число n та рядок s як параметри та повертає рядок із s рівним повторенням n.Приклади (введення -> вихід)

//* 6, "I"     -> "IIIIII"
//* 5, "Hello" -> "HelloHelloHelloHelloHello"

// function repeatStr(n, s) {
//    let str = '';
//    for (let i = 1; i <= n; i++) {
//       str += s;
//    }
//    return str;
// }

// console.log(repeatStr(77, 'World'));

// TODO Напишіть функцію для перетворення імені в ініціали. Ця ката містить два слова з одним пробілом між ними. На виході має бути дві великі літери з крапкою. Це має виглядати так:

//* Сем Харріс => S.H

//* Патрік Фіні => P.F

// function abbrevName(name) {
//    let arr = name.split(' ');
//    let initials = arr.map((item) => item.slice(0, 1)).join('.');
//    return initials.toUpperCase();
// }

// console.log(abbrevName('taras shevchenko'));

// TODO Завершіть функцію суми квадратів, щоб вона звела в квадрат кожне передане їй число, а потім підсумувала результати.

//* Наприклад, for [1, 2, 2]має повернутися 9тому що

// function squareSum(numbers) {
//    let squares = numbers.map((num) => {
//       return num * num;
//    });
//    return squares.length !== 0 ? squares.reduce((a, b) => a + b) : 0;
// }

// console.log(squareSum([2, 3, 5]));

// TODO Музей неймовірно нудних речей. Музей неймовірно нудних речей хоче позбутися деяких експонатів. Міріам, архітектор інтер’єрів, придумує план прибрати найнудніші експонати. Вона дає їм оцінку, а потім видаляє того, хто має найнижчий рейтинг. Однак як тільки вона закінчила оцінювати всі експонати, вона вирушила на важливий ярмарок, тому вона просить вас написати програму, яка повідомлятиме їй рейтинги експонатів після видалення найнижчого. Справедливо. завдання

// TODO Дано масив цілих чисел, вилучіть найменше значення. Не змінюйте оригінальний масив/список. Якщо є кілька елементів з однаковим значенням, видаліть той із найнижчим індексом. Якщо ви отримуєте порожній масив/список, поверніть порожній масив/список. Не змінюйте порядок елементів, які залишилися.

// Приклади
// * Input: [1,2,3,4,5], output = [2,3,4,5]
// * Input: [5,3,2,1,4], output = [5,3,2,4]
// * Input: [2,2,1,2,1], output = [2,2,2,1]

// function removeSmallest(numbers) {
//    if (numbers.length === 0) {
//       return [];
//    }

//    let minValue = Math.min(...numbers);
//    let minIndex = numbers.indexOf(minValue);
//    return numbers.slice(0, minIndex).concat(numbers.slice(minIndex + 1));
// }

// console.log(removeSmallest([2, 3, 5, 1, 7, 1]));
// console.log(removeSmallest([]));

//TODO Створіть просту функцію під назвою greet, яка повертає найвідоміше "hello world!". Очки стилю Звичайно, це настільки просто, наскільки це можливо. Але наскільки розумним ви можете бути, щоб створити найкреативніший "привіт, світ", який тільки можете придумати? Яке рішення «привіт, світ» ви хотіли б показати своїм друзям?

// const greet = (sayHello) => sayHello;
// function greet() {
//    return 'hello world!';
// }
// console.log(greet('Hello World!'));

//TODO У маленькому місті чисельність населення становить p0 = 1000 на початку року. Населення регулярно збільшується на 2% з кожним роком і більше того, 50 щороку в місто приїжджають жити нові жителі. Скільки років потрібно місту, щоб його населення перевищувало або дорівнювало p = 1200 жителям?

//TODO Наприкінці першого року буде: 1000 + 1000 * 0,02 + 50 => 1070 мешканців.
//TODO Наприкінці 2 - го курсу буде:   житель(** кількість жителів є цілим числом **)
//TODO Наприкінці 3-го курсу буде: 1141 + 1141 * 0,02 + 50 => 1213 На це знадобиться цілих 3 роки.

//TODO Більш загальні параметри: p0, percent, aug (мешканців, які приїжджають або виїжджають щороку), p (населення дорівнювати або перевищувати).
//TODO функція nb_yearмає повертати nкількість повних років, необхідних для отримання чисельності населення, більшої або рівної p. aug — ціле число, відсоток — додатне або нульове плаваюче число, p0 і p — додатні цілі числа(> 0)

//TODO Примітка: Не забудьте перетворити параметр percent як відсоток у тілі вашої функції: якщо параметр percent дорівнює 2, ви повинні перетворити його на 0,02. Немає фракцій людей. Наприкінці кожного року чисельність населення є цілим числом: 252.8 округляються до 252 осіб.

// function nbYear(p0, percent, aug, p) {
//    let currentPopulation = p0;
//    let years = 0;

//    while (currentPopulation < p) {
//       currentPopulation +=
//          Math.floor(currentPopulation * (percent / 100)) + aug;
//       years++;
//    }

//    return years;
// }

// console.log(nbYear(1500, 5, 100, 5000));

// TODO На фабриці принтер друкує етикетки для коробок. Для одного типу коробок друкар має використовувати кольори, які для простоти названо літерами з a до m. Кольори, які використовує принтер, записуються в контрольний рядок. Наприклад, «хороший» контрольний рядок означатиме, aaabbbbhaijjjm що принтер використав тричі колір a, чотири рази b, один раз колір h, потім один раз колір a...

// TODO Іноді виникають проблеми: відсутність кольорів, технічна несправність і створюється "поганий" контрольний рядок, наприклад, aaaxbbbbyyhwawiwjjjwwm з літерами не з a до m.Ви повинні написати функцію printer_error, яка, заданий рядок, повертатиме частоту помилок принтера як рядок, що представляє раціональне число, чисельник якого є кількістю помилок, а знаменник – довжиною рядка керування.Не зводьте цей дріб до більш простого виразу.Рядок має довжину більше або дорівнює одиниці і містить лише літери від a до z.

//* s="aaabbbbhaijjjm"
//* printer_error(s) => "0/14"

//* s="aaaxbbbbyyhwawiwjjjwwm"
//* printer_error(s) => "8/22"

function printerError(s) {
   // your code
}

console.log(String.fromCharCode(97, 122));

// m - 109

console.log(printerError('aaaxbbbbyyhwawiwjjjwwm'));
